name: "ConTagNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 227
    mean_value: 97
    mean_value: 104
    mean_value: 109
    mirror: true
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/data_train"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 227
    mean_value: 97
    mean_value: 104
    mean_value: 109
    mirror: false
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/data_test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/label_train"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/label_test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "data_con"
  type: "Data"
  top: "data_con"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/context_train"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data_con"
  type: "Data"
  top: "data_con"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/context_test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "data_ucon"
  type: "Data"
  top: "data_ucon"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/ucontext_train"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data_ucon"
  type: "Data"
  top: "data_ucon"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/ucontext_test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "data_upref"
  type: "Data"
  top: "data_upref"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/upref_train"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data_upref"
  type: "Data"
  top: "data_upref"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/vyzuer/work/caffe/data/ftags/upref_test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8_cond1"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8_cond1"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "fc8_cond2"
  type: "InnerProduct"
  bottom: "data_upref"
  top: "fc8_cond2"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "fc9_cond"
  bottom: "fc8_cond1"
  bottom: "fc8_cond2"
  top: "fc9_cond"
  type: "Eltwise"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "fc10"
  type: "InnerProduct"
  bottom: "fc9_cond"
  top: "fc10"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu10"
  type: "ReLU"
  bottom: "fc10"
  top: "fc10"
}
layer {
  name: "drop10"
  type: "Dropout"
  bottom: "fc10"
  top: "fc10"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc1_context"
  type: "InnerProduct"
  bottom: "data_con"
  top: "fc1_context"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu1_context"
  type: "ReLU"
  bottom: "fc1_context"
  top: "fc1_context"
}
layer {
  name: "drop1_context"
  type: "Dropout"
  bottom: "fc1_context"
  top: "fc1_context"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc1_upref"
  type: "InnerProduct"
  bottom: "data_ucon"
  top: "fc1_upref"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu1_upref"
  type: "ReLU"
  bottom: "fc1_upref"
  top: "fc1_upref"
}
layer {
  name: "drop1_upref"
  type: "Dropout"
  bottom: "fc1_upref"
  top: "fc1_upref"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "concat_context"
  bottom: "fc1_context"
  bottom: "fc1_upref"
  top: "fc0_con"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fc1_con"
  type: "InnerProduct"
  bottom: "fc0_con"
  top: "fc1_con"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu1_con"
  type: "ReLU"
  bottom: "fc1_con"
  top: "fc1_con"
}
layer {
  name: "drop1_con"
  type: "Dropout"
  bottom: "fc1_con"
  top: "fc1_con"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc2_con"
  type: "InnerProduct"
  bottom: "fc1_con"
  top: "fc2_con"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_con"
  type: "ReLU"
  bottom: "fc2_con"
  top: "fc2_con"
}
layer {
  name: "drop2_con"
  type: "Dropout"
  bottom: "fc2_con"
  top: "fc2_con"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "concat"
  bottom: "fc10"
  bottom: "fc2_con"
  top: "fc8_con"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fc9_flickr_con"
  type: "InnerProduct"
  bottom: "fc8_con"
  top: "fc9_flickr_con"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu9_flickr_con"
  type: "ReLU"
  bottom: "fc9_flickr_con"
  top: "fc9_flickr_con"
}
layer {
  name: "drop9_flickr_con"
  type: "Dropout"
  bottom: "fc9_flickr_con"
  top: "fc9_flickr_con"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc10_flickr_con"
  type: "InnerProduct"
  bottom: "fc9_flickr_con"
  top: "fc10_flickr_con"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1540
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy"
  type: "EuclideanLoss"
  bottom: "fc10_flickr_con"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc10_flickr_con"
  bottom: "label"
  top: "loss"
}
